//___**Обзор Git и GitHub**
/* 
**Система управления версиями**

* Позволяет отслеживать изменения в исходном коде.
* Позволяет легко восстановить старые версии документа.
* Упрощает сотрудничество с другими членами команды.

**Git**

* Бесплатное программное обеспечение с открытым исходным кодом.
* Распределенная система управления версиями (DVCS).
* Позволяет пользователям из любой точки мира иметь копию вашего проекта на своем компьютере.
* Поддерживает стратегии ветвления, такие как ветвление функций.

**GitHub**

* Один из самых популярных веб-сервисов для репозиториев Git.

**Основные термины**

* SSH (Secure Shell) - метод безопасного удаленного входа с одного компьютера на другой.
* Репозиторий - содержит папки ваших проектов, настроенные для управления версиями.
* Форк - копия репозитория.
* Pull Request - способ попросить кого-нибудь проверить и одобрить ваши изменения, прежде чем они станут окончательными.
* Рабочий каталог - содержит файлы и подкаталоги на вашем компьютере, связанные с репозиторием Git.
* Коммит - снимок текущего состояния проекта на определенный момент времени вместе с описанием внесенных изменений.
* Ветка - отдельное направление разработки, которое позволяет самостоятельно работать над функциями или исправлениями.
* Объединение - объединяет изменения из одной ветки в другую.
* Клонирование - на вашем компьютере создается локальная копия удаленного репозитория Git.

**Заключение**

* Git - универсальная система управления версиями, используемая для отслеживания изменений в коде и совместной работы над программными проектами с другими пользователями.
* GitHub - один из самых популярных веб-сервисов для репозиториев Git.
* Основные термины, связанные с Git и GitHub: SSH, репозиторий протоколов, форк, запрос на перенос, рабочий каталог, коммит, ветвь, слияние и клонирование.
*/

//___Знакомство с GitHub
/*
**Репозитории исходного кода**

* Структура данных для хранения документов, включая исходный код приложения.
* Позволяют участникам отслеживать и поддерживать контроль версий.

**GitHub**

* Онлайн-хостинг для репозиториев Git.
* Размещен в дочерней компании Microsoft.
* Предлагает бесплатные профессиональные и корпоративные учетные записи.

**Особенности модели Git Repository**

* Распределенная система управления версиями.
* В первую очередь ориентирована на отслеживание исходного кода во время разработки.
* Содержит элементы для координации действий программистов, отслеживания изменений и поддержки нелинейных рабочих процессов.

**GitLab**

* Полноценная платформа DevOps, поставляемая в виде одного приложения.
* Предоставляет доступ к репозиториям Git, контролируемым управлением исходным кодом.
* Позволяет разработчикам сотрудничать, просматривать код, оставлять комментарии и помогать друг другу улучшать код.
* Позволяет разработчикам работать с собственной локальной копией кода.
* Позволяет разработчикам разветвлять и объединять код при необходимости.
* Упрощает тестирование и доставку с помощью встроенных функций непрерывной интеграции (CI) и непрерывной доставки (CD).
*/

